#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_sms.data.archive_file.lambda_zip: Reading...
module.lambda_push.data.archive_file.lambda_zip: Reading...
module.lambda_email.data.archive_file.lambda_zip: Reading...
module.lambda_sms.data.archive_file.lambda_zip: Read complete after 0s [id=32fb6fc8aa724c7408f68078ecb764ff60b1d88a]
module.lambda_email.data.archive_file.lambda_zip: Read complete after 0s [id=aca9b8730a3771d263390db2f86fb9b825195bc2]
module.lambda_push.data.archive_file.lambda_zip: Read complete after 0s [id=cf90aa5523c4458d7a7168027c795780e0f378b1]
module.iam_api_sns.aws_iam_role.apigateway_sns_role: Refreshing state... [id=aws-notification-platform-dev-apigateway-sns-role]
module.api_gateway.aws_api_gateway_rest_api.notification_api: Refreshing state... [id=4ml0u9l3pg]
module.sns.aws_sns_topic.push_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic]
module.sns.aws_sns_topic.email_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic]
module.sns.aws_sns_topic.sms_topic: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic]
module.s3_website.aws_s3_bucket.website_bucket: Refreshing state... [id=aws-notification-platform-dev-website]
module.s3_website.aws_s3_bucket_object.index: Refreshing state... [id=index.html]
module.s3_website.aws_s3_bucket_object.error: Refreshing state... [id=error.html]
module.lambda_email.aws_lambda_function.email_lambda: Refreshing state... [id=aws-notification-platform-dev-email]
module.lambda_sms.aws_lambda_function.sms_lambda: Refreshing state... [id=aws-notification-platform-dev-sms]
module.lambda_push.aws_lambda_function.push_lambda: Refreshing state... [id=aws-notification-platform-dev-push]
module.api_gateway.aws_api_gateway_resource.send_push: Refreshing state... [id=vtykov]
module.api_gateway.aws_api_gateway_resource.send_sms: Refreshing state... [id=rvbz48]
module.api_gateway.aws_api_gateway_resource.send_email: Refreshing state... [id=066h1y]
module.api_gateway.aws_api_gateway_method.post_send_sms: Refreshing state... [id=agm-4ml0u9l3pg-rvbz48-POST]
module.api_gateway.aws_api_gateway_method.post_send_push: Refreshing state... [id=agm-4ml0u9l3pg-vtykov-POST]
module.api_gateway.aws_api_gateway_method.post_send_email: Refreshing state... [id=agm-4ml0u9l3pg-066h1y-POST]
module.sns.aws_sns_topic_subscription.email_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic:6b56a09b-f430-43c1-a0f2-c2951ed11f85]
module.sns.aws_sns_topic_subscription.sms_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic:c8a8c98f-3c4d-47f4-90d3-6743501d732c]
module.sns.aws_sns_topic_subscription.push_lambda_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic:aba8dbb0-18c0-48ee-be68-37d1e1f17197]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_deployment.api_deployment will be created
  + resource "aws_api_gateway_deployment" "api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "4ml0u9l3pg"
      + stage_name    = "dev"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_email_integration will be created
  + resource "aws_api_gateway_integration" "post_send_email_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-apigateway-sns-role"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-email-topic"
                }
            )
        }
      + resource_id             = "066h1y"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_push_integration will be created
  + resource "aws_api_gateway_integration" "post_send_push_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-apigateway-sns-role"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-push-topic"
                }
            )
        }
      + resource_id             = "vtykov"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.api_gateway.aws_api_gateway_integration.post_send_sms_integration will be created
  + resource "aws_api_gateway_integration" "post_send_sms_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-apigateway-sns-role"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_templates       = {
          + "application/json" = jsonencode(
                {
                  + Message  = "$util.escapeJavaScript($input.body)"
                  + TopicArn = "arn:aws:sns:us-east-1:251950841878:aws-notification-platform-dev-sms-topic"
                }
            )
        }
      + resource_id             = "rvbz48"
      + rest_api_id             = "4ml0u9l3pg"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:us-east-1:sns:action/Publish"
    }

  # module.iam_lambda.aws_iam_policy_attachment.lambda_basic_execution will be created
  + resource "aws_iam_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + name       = "aws-notification-platform-dev-lambda-basic-execution"
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + roles      = [
          + "aws-notification-platform-dev-lambda-role",
        ]
    }

  # module.iam_lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "aws-notification-platform-dev-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda_email.aws_lambda_function.email_lambda will be updated in-place
  ~ resource "aws_lambda_function" "email_lambda" {
        id                             = "aws-notification-platform-dev-email"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_push.aws_lambda_function.push_lambda will be updated in-place
  ~ resource "aws_lambda_function" "push_lambda" {
        id                             = "aws-notification-platform-dev-push"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_sms.aws_lambda_function.sms_lambda will be updated in-place
  ~ resource "aws_lambda_function" "sms_lambda" {
        id                             = "aws-notification-platform-dev-sms"
      ~ role                           = "arn:aws:iam::251950841878:role/aws-notification-platform-dev-lambda-role" -> (known after apply)
        tags                           = {}
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.s3_website.aws_s3_bucket.website_bucket will be destroyed
  # (because aws_s3_bucket.website_bucket is not in configuration)
  - resource "aws_s3_bucket" "website_bucket" {
      - arn                         = "arn:aws:s3:::aws-notification-platform-dev-website" -> null
      - bucket                      = "aws-notification-platform-dev-website" -> null
      - bucket_domain_name          = "aws-notification-platform-dev-website.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "aws-notification-platform-dev-website.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "aws-notification-platform-dev-website" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - website_domain              = "s3-website-us-east-1.amazonaws.com" -> null
      - website_endpoint            = "aws-notification-platform-dev-website.s3-website-us-east-1.amazonaws.com" -> null
        # (3 unchanged attributes hidden)

      - grant {
          - id          = "4b07020e908637fce2d129422ac0f31d8e99d14ba431f36b740df2433a5a2212" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      - website {
          - error_document           = "error.html" -> null
          - index_document           = "index.html" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.s3_website.aws_s3_bucket_object.error will be destroyed
  # (because aws_s3_bucket_object.error is not in configuration)
  - resource "aws_s3_bucket_object" "error" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::aws-notification-platform-dev-website/error.html" -> null
      - bucket                        = "aws-notification-platform-dev-website" -> null
      - bucket_key_enabled            = false -> null
      - content                       = "<html><body><h1>Error occurred.</h1></body></html>" -> null
      - content_type                  = "text/html" -> null
      - etag                          = "050d13646e3428dacf2b258f38f0cb21" -> null
      - force_destroy                 = false -> null
      - id                            = "error.html" -> null
      - key                           = "error.html" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (9 unchanged attributes hidden)
    }

  # module.s3_website.aws_s3_bucket_object.index will be destroyed
  # (because aws_s3_bucket_object.index is not in configuration)
  - resource "aws_s3_bucket_object" "index" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::aws-notification-platform-dev-website/index.html" -> null
      - bucket                        = "aws-notification-platform-dev-website" -> null
      - bucket_key_enabled            = false -> null
      - content                       = <<-EOT
            <!DOCTYPE html>
            <html>
            <head>
                <title>Notification Platform</title>
            </head>
            <body>
                <h1>Notification Platform</h1>
                <button onclick="sendNotification()">Send Notification</button>
                <script>
                    function sendNotification() {
                        // Call the API Gateway endpoint to trigger an Email notification
                        const apiEndpoint = "https://4ml0u9l3pg.execute-api.us-east-1.amazonaws.com/dev/";
                        fetch(apiEndpoint + "sendEmail", {
                            method: "POST",
                            headers: {
                                "Content-Type": "application/json"
                            },
                            body: JSON.stringify({ message: "Test notification" })
                        })
                        .then(response => response.json())
                        .then(data => alert("Response: " + JSON.stringify(data)))
                        .catch(error => alert("Error: " + error));
                    }
                </script>
            </body>
            </html>
        EOT -> null
      - content_type                  = "text/html" -> null
      - etag                          = "74bf3b03aa8e1c31cf9b2e8d86cb5cca" -> null
      - force_destroy                 = false -> null
      - id                            = "index.html" -> null
      - key                           = "index.html" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (9 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.api_gateway.aws_api_gateway_deployment.api_deployment,
  on modules/api_gateway/main.tf line 117, in resource "aws_api_gateway_deployment" "api_deployment":
 117:   stage_name  = var.environment

The attribute "stage_name" will be removed in a future major version. Use an
explicit "aws_api_gateway_stage" instead.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Dubovsky-Andrey, Action: `pull_request`*